# SetTexSpace2DRot

## Description
Procedure SetTexSpace2DRot sets the rotation of the referenced texture space.

```pascal
PROCEDURE SetTexSpace2DRot(
				textureSpace    : HANDLE;
				rotationDegrees : REAL);
```

```python

def vs.SetTexSpace2DRot(textureSpace, rotationDegrees):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|textureSpace|HANDLE|Handle to texture space.|
|rotationDegrees|REAL|Rotation of texture space(in degrees).|

## Remarks
Sets rotation in degrees

## Version
```diff
- SetTexSpace2DRot is obsolete as of Vectorworks 2009
```

Availability: from VectorWorks8.0
## Category
* Textures